app/controllers/athletes/registrations_controller.rb

  def create
    @athlete = Athlete.new athlete_params
    # binding.pry
    if @athlete.save
---
INSERT INTO "athletes" ("first_name", "last_name", "height", "weight", "primary_position", "jersey_number", "class_of", "created_at", "updated_at", "gpa", "display_gpa") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"