app/controllers/home_controller.rb

UPDATE "users" SET "last_online_at" = '2018-06-04 04:25:04.509521' WHERE "users"."id" = $1  [["id", 912547609]]
---
  def update_online_time
    current_user.update_columns(
      last_online_at: Time.current
    )